docs/zfc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2017-12-03 Sun 11:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ZFC</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
<p style="display:none"> \(\newcommand{\threepartdef}[6]{\left\{\begin{array}{lll} #1 & \mbox{if } #2 \\ #3 & \mbox{if } #4 \\ #5 & \mbox{if } #6 \end{array} \right.}\) </p>
<p style="display:none"> \(\newcommand{\twopartdef}[4]{\left\{\begin{array}{ll} #1 & \mbox{if } #2 \\ #3 & \mbox{if } #4 \end{array} \right.}\) </p>
</head>
<body>
<div id="content">
<h1 class="title">ZFC</h1>
<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgca6c875">ZFC - Pablo Baeyens</a>
<ul>
<li><a href="#orgf9057c0">Axiomas de la igualdad</a></li>
<li><a href="#org94d1559">Números como conjuntos</a>
<ul>
<li><a href="#orga7186c4">Números naturales</a></li>
<li><a href="#org7cb155a">Otra construcción posible</a></li>
<li><a href="#org4c9ea7a">Construcción de funciones</a></li>
</ul>
</li>
<li><a href="#org1cfc7d7">Restricciones</a></li>
<li><a href="#orga5166f8">Axiomas de la teoría de conjuntos</a>
<ul>
<li><a href="#org26c25e8">0. Axioma de existencia</a></li>
<li><a href="#orgd95ece4">1. Axioma de extensionalidad</a></li>
<li><a href="#orge3e147c">2. Axioma de comprensión</a>
<ul>
<li><a href="#org2c710de">Paradoja de Russell</a></li>
<li><a href="#orgea72b53">El número de axiomas es numerable</a></li>
<li><a href="#org69c242b">NBG</a></li>
<li><a href="#orgc5dda02">Diferencia de conjuntos</a></li>
<li><a href="#org7fc8844">Intersección de conjuntos</a></li>
</ul>
</li>
<li><a href="#org70121b8">3. Axioma del par</a>
<ul>
<li><a href="#org048832c">Naturales</a></li>
<li><a href="#org2186cf1">Hay conjuntos no vacíos</a></li>
<li><a href="#orgb5393ec">Pares ordenados</a></li>
</ul>
</li>
<li><a href="#org769588b">4. Axioma de la unión</a></li>
<li><a href="#org4f02b26">5. Axioma del infinito</a>
<ul>
<li><a href="#org91ebae4">Finitud</a></li>
</ul>
</li>
<li><a href="#orge9eb60c">6. Axioma del conjunto potencia</a>
<ul>
<li><a href="#org70989f6">Producto cartesiano</a></li>
<li><a href="#orgf40838e">Funciones</a></li>
</ul>
</li>
<li><a href="#org5be0e26">7. Axioma de reemplazamiento</a>
<ul>
<li><a href="#orgd445ec3">Definiendo el conjunto de potencias</a></li>
<li><a href="#orgb41b239">Definiendo la imagen por un funcional</a></li>
<li><a href="#orge294b68">No existe el conjunto de todos los conjuntos.</a></li>
</ul>
</li>
<li><a href="#org657abb1">8. Axioma de elección</a></li>
<li><a href="#org23667c6">9. Axioma de fundación</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgca6c875" class="outline-2">
<h2 id="orgca6c875">ZFC - Pablo Baeyens</h2>
<div class="outline-text-2" id="text-orgca6c875">
<p>
Utilizando lógica de primer orden.
</p>

<p>
\[
\wedge, \implies, \iff, \forall, \exists
\]
</p>

<p>
Además de:
</p>

<ul class="org-ul">
<li>Un conjunto infinito numerable de variables: \(x_1,x_2,\dots\)</li>
<li>Sólo puede cuantificarse sobre variables.</li>
<li>Reglas para fórmulas bien formadas.</li>
</ul>

<p>
Símbolos propios de la teoría de conjuntos:
</p>

<ul class="org-ul">
<li>\(=, \in\)</li>
</ul>

<p>
Se usa internamente la axiomática de la lógica de primer orden.
</p>
</div>

<div id="outline-container-orgf9057c0" class="outline-3">
<h3 id="orgf9057c0">Axiomas de la igualdad</h3>
<div class="outline-text-3" id="text-orgf9057c0">
<p>
La igualdad es relación de equivalencia. Es
</p>

<ol class="org-ol">
<li>Reflexiva, \(\forall x: x=x\).</li>
<li>Transitiva, \(\forall x,y,z: x=y \wedge x=y \implies x=z\).</li>
<li>Simétrica, \(\forall x,y : x=y \iff y=x\).</li>
<li>Sustitución, \(\forall x,y: x=y \implies \varphi \iff \varphi'\) donde \(\varphi'\) sale de sustituir \(x\).</li>
</ol>
</div>
</div>

<div id="outline-container-org94d1559" class="outline-3">
<h3 id="org94d1559">Números como conjuntos</h3>
<div class="outline-text-3" id="text-org94d1559">
<p>
Algunas teorías consideran elementos que no tienen elementos dentro.
En nuestro caso usaremos conjuntos para representar todos los objetos
matemáticos.
</p>
</div>

<div id="outline-container-orga7186c4" class="outline-4">
<h4 id="orga7186c4">Números naturales</h4>
<div class="outline-text-4" id="text-orga7186c4">
<p>
Definimos:
</p>

<ul class="org-ul">
<li>\(0 = \varnothing\)</li>
<li>\(S(x) = x \cup \{x\}\)</li>
</ul>
</div>
</div>

<div id="outline-container-org7cb155a" class="outline-4">
<h4 id="org7cb155a">Otra construcción posible</h4>
<div class="outline-text-4" id="text-org7cb155a">
<p>
Definiendo:
</p>

<ul class="org-ul">
<li>\(\varnothing\)</li>
<li>\(S(x) = \{x\}\)</li>
</ul>
</div>
</div>

<div id="outline-container-org4c9ea7a" class="outline-4">
<h4 id="org4c9ea7a">Construcción de funciones</h4>
<div class="outline-text-4" id="text-org4c9ea7a">
<p>
Para definir una función, usamos su gráfico:
</p>

<p>
\[\{(a,b) \in A \times B \mid f(a) = b\}\]
</p>
</div>
</div>
</div>

<div id="outline-container-org1cfc7d7" class="outline-3">
<h3 id="org1cfc7d7">Restricciones</h3>
<div class="outline-text-3" id="text-org1cfc7d7">
<p>
No podemos hablar todavía del conjunto de todos los conjuntos. Dentro
de ZFC no podemos hablar de cosas como \(Obj(\mathtt{Set})\).
</p>
</div>
</div>

<div id="outline-container-orga5166f8" class="outline-3">
<h3 id="orga5166f8">Axiomas de la teoría de conjuntos</h3>
<div class="outline-text-3" id="text-orga5166f8">
<p>
Tomamos como ciertos:
</p>
</div>

<div id="outline-container-org26c25e8" class="outline-4">
<h4 id="org26c25e8">0. Axioma de existencia</h4>
<div class="outline-text-4" id="text-org26c25e8">
<p>
\(\exists x : x=x\)
</p>
</div>
</div>

<div id="outline-container-orgd95ece4" class="outline-4">
<h4 id="orgd95ece4">1. Axioma de extensionalidad</h4>
<div class="outline-text-4" id="text-orgd95ece4">
<p>
\(\forall x,y:(\forall z: z\in x \implies z \in y) \implies x = y\)
</p>

<p>
De paso definimos la inclusión:
</p>

<p>
\[
x \subseteq y := \forall z: z\in x \implies z \in y
\]
</p>

<p>
Y este axioma es equivalente a la antisimetría de la inclusión.
</p>
</div>
</div>

<div id="outline-container-orge3e147c" class="outline-4">
<h4 id="orge3e147c">2. Axioma de comprensión</h4>
<div class="outline-text-4" id="text-orge3e147c">
<p>
Exigiendo que \(A\) no aparezca como variable libre en \(\varphi\).
</p>

<p>
\[
\forall A: \exists B: \forall z:\left( \varphi(z) \vee z \in A\right) \iff z \in B
\]
</p>

<p>
Puede usarse para demostrar que existe el conjunto vacío. O que
no existe el conjunto universal.
</p>
</div>

<div id="outline-container-org2c710de" class="outline-5">
<h5 id="org2c710de">Paradoja de Russell</h5>
<div class="outline-text-5" id="text-org2c710de">
<p>
Supongamos el universal \(U\). Podríamos definir:
</p>

<p>
\[
R = \{x \in U \mid x \notin x\}
\]
</p>

<p>
Tanto \(R \in R\) como \(R \notin R\). Para evitarla podríamos haber usado
estratificación.
</p>
</div>
</div>

<div id="outline-container-orgea72b53" class="outline-5">
<h5 id="orgea72b53">El número de axiomas es numerable</h5>
<div class="outline-text-5" id="text-orgea72b53">
<p>
Las fórmulas son sucesiones finitas de los símbolos que hemos usado
antes. Al haber una cantidad numerable de símbolos, las fórmulas son
numerables, y los axiomas que se generan en este esquema lo son.
</p>
</div>
</div>

<div id="outline-container-org69c242b" class="outline-5">
<h5 id="org69c242b">NBG</h5>
<div class="outline-text-5" id="text-org69c242b">
<p>
En la teoría axiomática de Von-Neumann se usa un número finito de
axiomas.
</p>
</div>
</div>

<div id="outline-container-orgc5dda02" class="outline-5">
<h5 id="orgc5dda02">Diferencia de conjuntos</h5>
<div class="outline-text-5" id="text-orgc5dda02">
<p>
\[A-B = \{x \in A \mid x \notin B\}\]
</p>
</div>
</div>

<div id="outline-container-org7fc8844" class="outline-5">
<h5 id="org7fc8844">Intersección de conjuntos</h5>
<div class="outline-text-5" id="text-org7fc8844">
<p>
Nótese que todavía no podemos definir la unión arbitraria.
</p>

<p>
\[
\bigcap {\cal F} = \{x \in A \mid \forall y \in {\cal F} x \in y\}
\]
</p>
</div>
</div>
</div>

<div id="outline-container-org70121b8" class="outline-4">
<h4 id="org70121b8">3. Axioma del par</h4>
<div class="outline-text-4" id="text-org70121b8">
<p>
Dados dos conjuntos, tenemos uno que los contiene a los dos:
</p>

<p>
\[
\forall a,b : \exists z:
(a\in z \vee b \in z)
\]
</p>
</div>

<div id="outline-container-org048832c" class="outline-5">
<h5 id="org048832c">Naturales</h5>
<div class="outline-text-5" id="text-org048832c">
<p>
Con este axioma podemos construir los naturales en su segunda 
construcción.
</p>
</div>
</div>

<div id="outline-container-org2186cf1" class="outline-5">
<h5 id="org2186cf1">Hay conjuntos no vacíos</h5>
<div class="outline-text-5" id="text-org2186cf1">
<p>
Hasta ahora, los axiomas eran consistentes con que sólo existiera
el conjunto vacío.
</p>
</div>
</div>

<div id="outline-container-orgb5393ec" class="outline-5">
<h5 id="orgb5393ec">Pares ordenados</h5>
<div class="outline-text-5" id="text-orgb5393ec">
<p>
Definimos un par ordenado:
</p>

<p>
\[
(a,b) := \{a , \{a,b\}\}
\]
</p>
</div>
</div>
</div>

<div id="outline-container-org769588b" class="outline-4">
<h4 id="org769588b">4. Axioma de la unión</h4>
<div class="outline-text-4" id="text-org769588b">
<p>
Para una colección de conjuntos, crearemos una unión:
</p>

<p>
\[
\forall {\cal F}: \exists A: \forall Y,x: (x \in Y \wedge Y \in {\cal F}) \implies x \in A
\]
</p>
</div>
</div>

<div id="outline-container-org4f02b26" class="outline-4">
<h4 id="org4f02b26">5. Axioma del infinito</h4>
<div class="outline-text-4" id="text-org4f02b26">
<p>
Construye directamente los números naturales:
</p>

<p>
\[
\exists I: \varnothing \in I \wedge \forall x: x\in I \implies S(x) \in I \longrightarrow \exists \mathbb{N}
\]
</p>

<p>
Lleva a la existencia de cardinales grandes.
</p>
</div>

<div id="outline-container-org91ebae4" class="outline-5">
<h5 id="org91ebae4">Finitud</h5>
<div class="outline-text-5" id="text-org91ebae4">
<p>
Hasta ahora, podríamos trabajar suponiendo todos los conjuntos finitos.
</p>
</div>
</div>
</div>

<div id="outline-container-orge9eb60c" class="outline-4">
<h4 id="orge9eb60c">6. Axioma del conjunto potencia</h4>
<div class="outline-text-4" id="text-orge9eb60c">
<p>
Existencia del conjunto potencia:
</p>

<p>
\[
\forall x: \exists y: \forall z: z \subseteq x \implies z \in y
\]
</p>
</div>

<div id="outline-container-org70989f6" class="outline-5">
<h5 id="org70989f6">Producto cartesiano</h5>
<div class="outline-text-5" id="text-org70989f6">
<p>
Podemos definir el producto cartesiano de \(A,B\). Tenemos que todos los
elementos \(a\in A,b \in B\) llevan a \(\{a,b\} \in {\cal P}(A,B)\).
</p>

<p>
\[
A \times B = \{ x \in {\cal P}{\cal P}(A \cup B) \mid x = (a,b), a \in A, b \in B\}
\]
</p>

<p>
Nótese que así sólo hemos creado el producto cartesiano finito.
</p>
</div>
</div>

<div id="outline-container-orgf40838e" class="outline-5">
<h5 id="orgf40838e">Funciones</h5>
<div class="outline-text-5" id="text-orgf40838e">
<p>
Con el producto cartesiano, podemos pasar a ver las funciones como su
gráfico.
</p>
</div>
</div>
</div>
<div id="outline-container-org5be0e26" class="outline-4">
<h4 id="org5be0e26">7. Axioma de reemplazamiento</h4>
<div class="outline-text-4" id="text-org5be0e26">
<p>
Con estos seis axiomas, que constituyen la teoría de Zermelo, no
podemos definir el conjunto con:
</p>

<p>
\[
\mathbb{N}, {\cal P}\mathbb{N}, {\cal P}{\cal P}\mathbb{N}, \dots
\]
</p>

<p>
Un predicado funcional es una fórmula con variables libres \(\varphi(x,y)\) 
que se comporta como una función:
</p>

<p>
\[
\forall x: \exists! y: \varphi(x,y)
\]
</p>

<p>
Tenemos entonces:
</p>

<p>
\[
\forall z: \exists \omega: \forall x,y: (x \in z \wedge \varphi(x,y) \implies y \in \omega)
\]
</p>
</div>

<div id="outline-container-orgd445ec3" class="outline-5">
<h5 id="orgd445ec3">Definiendo el conjunto de potencias</h5>
<div class="outline-text-5" id="text-orgd445ec3">
<p>
Usando la función \(n \mapsto {\cal P}^n(\mathbb{N})\).
</p>
</div>
</div>

<div id="outline-container-orgb41b239" class="outline-5">
<h5 id="orgb41b239">Definiendo la imagen por un funcional</h5>
<div class="outline-text-5" id="text-orgb41b239">
<p>
Definimos \(\{x \in A \mid \phi(x)\}\) partiendo en el caso de que exista y 
de que no.
</p>
</div>
</div>

<div id="outline-container-orge294b68" class="outline-5">
<h5 id="orge294b68">No existe el conjunto de todos los conjuntos.</h5>
<div class="outline-text-5" id="text-orge294b68">
<p>
Si existiera, podríamos usar todas las topologías triviales y desde ahí
el conjunto universal.
</p>
</div>
</div>
</div>
<div id="outline-container-org657abb1" class="outline-4">
<h4 id="org657abb1">8. Axioma de elección</h4>
<div class="outline-text-4" id="text-org657abb1">
<p>
Para cualquier familia de conjuntos sin ninguno vacío,
</p>

<p>
\[
\forall {\cal F} : 
\left(
\forall x \in {\cal F} :\varnothing \neq x
\implies 
\exists f : {\cal F} \to \bigcup {\cal F}: f(a) \in A
\right)
\]
</p>

<p>
Siendo \(f\) una función.
</p>
</div>
</div>

<div id="outline-container-org23667c6" class="outline-4">
<h4 id="org23667c6">9. Axioma de fundación</h4>
<div class="outline-text-4" id="text-org23667c6">
<p>
Para cualquier conjunto no vacío:
</p>

<p>
\[
\forall x: (x \neq \varnothing \implies \exists y: y \in x \wedge x \cap y = \varnothing)
\]
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Mario Román</p>
<p class="date">Created: 2017-12-03 Sun 11:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
